app/controllers/gossips_controller.rb

def show
    gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT 1  [["id", 1]]

def create
   gossip = Gossip.new(gossip_params)
  	if @gossip.save
---
INSERT INTO "gossips" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-10-25 15:20:48.599133"], ["updated_at", "2017-10-25 15:20:48.599133"]]